"use client";

import { Player, useTimer } from "../Player";
import { Editor } from "./Editor";
import TBH from "./TBH.json";

const 가사 = `  
어떤 인사가 괜찮을까 천 번쯤 상상해 봤어
근데 오늘도 천 번 하고 한 번 더 고민 중

막상 네 앞에 서니 꽁꽁 얼어버렸다
숨겨왔던 나의 맘 절반의 반도 주지를 못했어

아, 아, 아직은
준비가 안됐다구요
소용돌이쳐 어지럽다구

쏟아지는 맘을 멈출 수가 없을까?
너의 작은 인사 한마디에 요란해져서
네 맘의 비밀번호 눌러 열고 싶지만
너를 고민고민해도 좋은 걸 어쩌니

거울 앞에서 새벽까지 연습한 인사가
손을 들고 웃는 얼굴을 하고서 고개를 숙였다

아, 아, 아직도
준비가 안됐나 봐요
소용돌이쳐 어지럽다구

쏟아지는 맘을 멈출 수가 없을까?
너의 작은 인사 한마디에 요란해져서
네 맘의 비밀번호 눌러 열고 싶지만
너를 고민고민해도 좋은 걸

이러지도 저러지도 못하는데
속이 왈칵 뒤집히고
이쯤 왔으면 눈치 챙겨야지
날 봐달라구요!

좋아한다 너를 좋아한다 좋아해
좋아해!

너를 많이 많이 좋아한단 말이야
벅차오르다 못해 내 맘이 쿡쿡 아려와
두 번은 말 못 해 너 지금 잘 들어봐
매일 고민하고 연습했던 말
좋아해

어이 어이 어이 어이 어이 어이 어이 어이 어이 어이
`;

//고중 $1 = 약 1/6초 (30/178초), 추후 15/178초로 조정

const 악보 = `
\\ $126
\\원$4투$4Q$2W$2E$2R$4
\\어$2이$2!$0어$2이$2!$0어$2이$2!$0어$2이$2!$0
\\어$2이$2!$0어$2이$2!$0어$2이$2!$0어$2이$2!$0
\\어$2이$2!$0어$2이$2!$0
\\ $23
\\어$1떤$1 $0인$2사$2가$2 $0괜$1찮$1을$2까$5 $0천$1 $0번$2쯤$2 $0상$2상$1해$1 $0봤$1어$5
\\근$1데$1 $0오$2늘$2도$2 $0천$1 $0번$1 $0하$2고$2 $0한$1 $0번$2 $0더$1 $0고$2민$1 $0중$10
\\막$2상$2 $0네$1 $0앞$1에$1 $0서$3니$1 $0꽁$2꽁$3 $0얼$2어$1버$3렸$1다$5
\\숨$2겨$2왔$2던$2 $0나$2의$2 $0맘$2 $0절$2반$1의$1 $0반$1도$7 $0주$2지$2를$2 $0못$1했$1어$2
\\아$4,$0 $0아$4,$0 $0아$2직$2은$4
\\준$2비$2가$2 $0안$1됐$1다$2구$2요$4
\\소$2용$2돌$2이$2쳐$3 $0어$1지$1럽$1다$1구$13
\\쏟$2아$2지$2는$2 $0맘$2을$2 $0멈$2출$2 $0수$2가$2 $0없$6을$1까$5?$0
\\너$2의$2 $0작$2은$2 $0인$2사$2 $0한$2마$2디$2에$2 $0요$4란$4해$3져$1서$4
\\네$2 $0맘$1의$2 $0비$2밀$2번$2호$2 $0눌$3러$3 $0열$1고$1 $0싶$1지$1만$4
\\너$2를$2 $0고$2민$2고$2민$2해$2도$2 $0좋$2은$2 $0걸$11 $0어$1쩌$1니$6
\\ㅁ$4ㅁ$4ㅁ$4ㅁ$4한$4와$4ㅁ$4ㅁ$41
\\거$2울$2 $0앞$1에$1서$1 $0새$3벽$1까$2지$2 $0연$1습$2한$1 $0인$3사$1가$5
\\손$2을$2 $0들$2고$2 $0웃$2는$2 $0얼$2굴$2을$1 $0하$1고$1서$7 $0고$2개$2를$2 $0숙$1였$1다$2
\\아$4,$0 $0아$4,$0 $0아$2직$2도$4
\\준$2비$2가$2 $0안$1됐$1나$2 $0봐$2요$4
\\소$2용$2돌$2이$2쳐$3 $0어$1지$1럽$1다$1구$13
\\쏟$2아$2지$2는$2 $0맘$2을$2 $0멈$2출$2 $0수$2가$2 $0없$6을$1까$5?$0
\\너$2의$2 $0작$2은$2 $0인$2사$2 $0한$2마$2디$2에$2 $0요$4란$4해$3져$1서$4
\\네$2 $0맘$1의$2 $0비$2밀$2번$2호$2 $0눌$3러$3 $0열$1고$1 $0싶$1지$1만$4
\\너$2를$2 $0고$2민$2고$2민$2해$2도$2 $0좋$2은$2 $0걸$18
\\이$1러$1지$1도$1 $0저$1러$1지$1도$1 $0못$1하$1는$1데$3
\\속$1이$1 $0왈$2칵$2 $0뒤$1집$1히$1고$6
\\이$1쯤$1 $0왔$2으$2면$2 $0눈$1치$1 $0챙$1겨$1야$1지$4
\\날$2 $0봐$2달$2라$2구$2요$75!$0
\\좋$2아$2한$2다$2 $0너$2를$2 $0좋$2아$2한$2다$2 $0좋$6아$1해$4.$1.$1.$1
\\좋$1아$1해$4!$0
\\너$2를$2 $0많$2이$2 $0많$2이$2 $0좋$2아$2한$2단$2 $0말$6이$1야$5
\\벅$2차$2오$2르$2다$2 $0못$2해$2 $0내$2 $0맘$2이$2 $0쿡$4쿡$4 $0아$3려$1와$4
\\두$2 $0번$1은$2 $0말$2 $0못$2 $0해$2 $0너$2 $0지$3금$3 $0잘$1 $0들$3어$1봐$4
\\매$2일$2 $0고$2민$2하$2고$2 $0연$2습$2했$2던$2 $0말$11
\\좋$1아$1해$4
\\어$4이$4 $0어$4이$4 $0어$4이$4 $0어$4이$4 $0어$4이$4
`;
const getData = () => {
  let time = 0;
  return 악보.split("\\").map((소절) => {
    const reg = /(.)\$([0-9]*)/g;
    const ret = [];
    let match;
    while ((match = reg.exec(소절)) != null) {
      ret.push({
        가사: match[1],
        응원: " ",
        박자: +match[2],
        시간: time,
      });
      time += (+match[2] * 30) / 178;
    }
    if (ret.length == 0) return { 소절: [], 시작시간: 1e9 };
    return { 소절: ret, 시작시간: ret[0].시간 };
  });
};

const DEBUG = false;
const data = DEBUG ? getData() : TBH;
console.log(data);
// eslint-disable-next-line @typescript-eslint/no-explicit-any
const 악보데이터: any[] = [];
const Header = () => {
  return <div className="flex"></div>;
};

const Footer = () => {
  return <div className="flex"></div>;
};

const 마디 = ({ offset }: { offset: number }) => {
  const arr = [0, 1, 2, 3, 4, 5, 6, 7];
  return (
    <>
      {arr.map((v) =>
        악보데이터[v + offset] !== 악보데이터[v + offset - 1] ? (
          <div key={v}>
            {v + offset} : {악보데이터[v + offset]}
          </div>
        ) : (
          <></>
        )
      )}
    </>
  );
};

const 한라인 = ({ offset }: { offset: number }) => {
  return (
    <>
      <마디 offset={offset} />
      <마디 offset={offset + 8} />
      <마디 offset={offset + 16} />
      <마디 offset={offset + 24} />
    </>
  );
};

const 악보컴포 = () => {
  const reg = /(.)\$([0-9]*)/g;
  const temp = [];
  let match = null;
  while ((match = reg.exec(악보)) != null) {
    temp.push(match);
    for (let i = 0; i < +match[2]; i++) 악보데이터.push(match[1]);
  }
  console.log(temp);
  console.log(악보데이터);
  const a = [];
  for (let i = 0; i < 20; i++) a.push(i * 32);
  return (
    <div className="flex">
      <div>
        {a.map((v) => (
          <한라인 key={v} offset={v} />
        ))}
      </div>
      <div>{악보}</div>
    </div>
  );
};

export default function main() {
  return (
    <div className="p-12">
      <Header />
      <Editor data={data} />
      <Footer />
    </div>
  );
}
