"use client";

import { Player, useTimer } from "../Player";
import TBH from "./TBH.json";

const 가사 = `  
어떤 인사가 괜찮을까 천 번쯤 상상해 봤어
근데 오늘도 천 번 하고 한 번 더 고민 중

막상 네 앞에 서니 꽁꽁 얼어버렸다
숨겨왔던 나의 맘 절반의 반도 주지를 못했어

아, 아, 아직은
준비가 안됐다구요
소용돌이쳐 어지럽다구

쏟아지는 맘을 멈출 수가 없을까?
너의 작은 인사 한마디에 요란해져서
네 맘의 비밀번호 눌러 열고 싶지만
너를 고민고민해도 좋은 걸 어쩌니
`;

//고중 $0 = 1/6초

const 악보 = `
\\ $209
\\어$1떤$1 $0인$2사$2가$2 $0괜$1찮$1을$2까$5 $0천$1 $0번$2쯤$2 $0상$2상$1해$1 $0봤$1어$5
\\근$1데$1 $0오$2늘$2도$2 $0천$1 $0번$1 $0하$2고$2 $0한$1 $0번$1 $0더$1 $0고$2민$1 $0중$10
\\막$2상$2 $0네$1 $0앞$1에$1 $0서$3니$1 $0꽁$2꽁$2 $0얼$3어$1버$3렸$1다$6
\\숨$2겨$2왔$2던$2 $0나$2의$2 $0맘$2 $0절$2반$1의$1 $0반$1도$7 $0주$2지$2를$2 $0못$1했$1어$4
\\아$4,$0 $0아$4,$0 $0아$2직$2은$4
\\준$2비$1가$2 $0안$1됐$1다$2구$2요$4
\\소$2용$2돌$2이$2쳐$4 $0어$1지$1럽$1다$1구$13
\\쏟$2아$2지$2는$2 $0맘$2을$2 $0멈$2출$2 $0수$2가$2 $0없$6을$1까$4?$0
\\너$2의$2 $0작$2은$2 $0인$2사$2 $0한$2마$2디$2에$2 $0요$4란$4해$4져$1서$4
\\네$2 $0맘$1의$2 $0비$2밀$2번$1호$2 $0눌$4러$4 $0열$1고$1 $0싶$1지$1만$4
\\너$2를$3 $0고$2민$2고$2민$2해$2도$2 $0좋$2은$2 $0걸$8 $0어$1쩌$1니$16
`;
const getData = () => {
  let time = 0;
  return 악보.split("\\").map((소절) => {
    const reg = /(.)\$([0-9]*)/g;
    const ret = [];
    let match;
    while ((match = reg.exec(소절)) != null) {
      ret.push({
        가사: match[1],
        응원: " ",
        박자: +match[2],
        시간: time,
      });
      time += +match[2] / 6;
    }
    if (ret.length == 0) return { 소절: [], 시작시간: 1e9 };
    return { 소절: ret, 시작시간: ret[0].시간 - ret[0].박자 / 6 };
  });
};

const DEBUG = false;
const data = DEBUG ? getData() : TBH.data;

const Header = () => {
  return <div className="flex"></div>;
};

const Footer = () => {
  return <div className="flex"></div>;
};

export default function main() {
  return (
    <div className="p-12">
      <Header />
      <Player data={data} />
      <Footer />
    </div>
  );
}
