export const 달리기 = [
  `시끄러운 마음, 어지러운 말들  
왜 그래 너에게?  
저 별이 반짝거려도  
넌 아무것도 보질 않네  
**있잖아** 잠깐 집에 들러서  
무거운 가방을 놓고 가자 (oh-oh), uh  
(Ooh) 먼지 쌓인 그 곳에  
내게 닿을 수 있는 손 **내밀고**  
**숨이 차오를 때까지 위로**  
뛰어올라 구겨진 마음을 던지자 (ah)  
(Oh) 숨이 차오를 때까지 위로  
뛰어올라 구겨진 사랑을 펼치자 (ah-ah, yeah)  
Ooh, ooh, ooh, ooh  
Ooh, ooh  
Ooh, ooh, ooh, ooh  
Ooh, ooh  `,
  `삐죽대는 마음 차가운 소리에  
넌 어찌 할지 몰라 **(이리 저리 불안해)**  
저 별이 반짝거려도 **(oh-oh)**  
넌 아무것도 보질 않네  
있잖아 잠깐 집에 들러서  
무거운 가방을 놓고 가자 (oh-oh), uh  
(Ooh) 먼지 쌓인 그 곳에  
내게 닿을 수 있는 손 **내밀고**  
**숨이 차오를 때까지 위로**  
뛰어올라 구겨진 마음을 던지자 (ah-ah)  
(Oh) 숨이 차오를 때까지 위로  
뛰어올라 구겨진 사랑을 펼치자 (ah-ah, yeah)  `,
  `Ooh, ooh, ooh-ooh-ooh  
서툰 우리 마음 속 반짝인 너의 얼굴  
Ooh, ooh, ooh-ooh-ooh  
손으로 가리지 마, 내게 잠시 틈을 줘  
그리고 밖으로 같이 나가자  
숨이 차오를 때까지 위로  
뛰어올라 구겨진 마음을 던지자 (ooh, ah-ah)  
숨이 차오를 때까지 위로  
뛰어올라 구겨진 사랑을 펼치자 (ah-ah)  
Ooh, ooh, ooh-ooh-ooh  
**숨이 차오를 때까지 위로**  
Ooh, ooh, ooh-ooh-ooh  
**숨이 차오를 때까지 위로**  `,
];
