export const 대관람차 = [
  `
 **(어이!)**  
 하루가  
너무 빠른 기분이 드는 날  
걸음을 돌려 **(oh)**  
천천히 내게 와줄래  
  
바쁜 마음은  
여기 잠시 멈추어 두고서  
도시 위에 뜬 **(oh)**  
우리만의 섬으로 가자  
  
낮아지는 저녁 하늘 아래로  
오렌지빛 커튼이 또 내리고  
참 길었던 이 하루도 잘 견뎌줘  
**고마워 (박수*2)**  
  &nbsp;  
언제나 네 곁에 있어  
어떤 날이 와도  
작아지는 맘을 껴안아  
세상 가장 높은 곳에서  
  
이제 감은 눈을 떠  
두려움보단 설레임을 안은 채  
봐, 오늘 너머 내일의 너를  
만나러 가고 있어  
  
**Woo- ah-**  `,
  `&nbsp;  
  숨차게  
  앞으로만 달리는 세계는  
바보 같아서 **(oh)**  
놓치는 게 더 많은데  
  
지금처럼  
느리게 가야 보이는  
태양의 인사는 **(oh)**  
매일 너를 기다리는 걸  
  
펼쳐지는 밤의 공원 사이로  
달빛은 더 선명하게 비추고  
두고 온 마음도 다시 한번  
**반짝여 (박수*2)**  
  &nbsp;  
언제나 네 곁에 있어  
어떤 날이 와도  
작아지는 맘을 껴안아  
세상 가장 높은 곳에서  
  
이제 감은 눈을 떠  
두려움보단 설레임을 안은 채  
봐, 오늘 너머 내일의 너를  
만나러 가고 있어  `,

  `&nbsp;  
  어떤 순간이 온대도  
서로 곁에 있다면  
뭐든 괜찮을 거야  
**내 손을 잡아**  
  &nbsp;  
언제라도 함께해 줘  
이 시간들 위로  
수백 번의 오늘이 와도  
마주 보며 웃을 수 있게  
  
크게 손을 흔들어  
아쉬움보단 설레임을 안은 채  
봐, 오늘 너머 내일의 너를  
만나러 가고 있어  
  &nbsp;  
**Woo- ah-**  
Going round and round  
**Woo- ah-**  
Going round and round  
**Woo- ah-**  
  &nbsp;  
널 기다리고 있어`,
];
