export const discord = [
  `  **(함성) (디스코드 화이팅! Q! W! E! R!)**  
딱 하나만 물어볼게 넌  
완벽이란 게 있다고 생각해  
조금은 어색한 하모니라 해도  
그것도 그것대로 꽤 **멋지잖아**  
누군간 나를 보고 수근대겠지만  
그런 무례함은 도로 넣어둬요  
**취향은 존중해** 그치만 이런 날  
밀어내긴 **쉽지 않을걸**  
&nbsp;  
무대 위 춤을 추는 **D선 상의 아리아**  
불협화음도 괜찮아, 뭐 문제가 되려나  
모두 내게 반해버려도 난 몰라요  
무지개 멜로디는 저 하늘을 **날아**  
**(We are! We are!)**  
이것도 나야 나야 나 **(We are! We are!)**  
이런 내가 궁금하니  **(We are! We are!)**  
뭘 해도 나야 나야 나 **(We are! We are!)**  
**들어줘 나의 discord**`,
  `&nbsp;  
주사위는 던져졌고  
이젠 눈앞에 온 거야 my turn  
조금 뻔뻔해도 눈감아줄래요  
작은 소동을 부리는 **game changer**  
모두가 나를 사랑할 순 없겠지만  
그렇대도 난 실망 따윈 안 해요  
**겸손은 어려워** 그치만 이런 날  
미워하긴 **쉽지 않을걸**  
&nbsp;  
무대 위 춤을 추는 **D선 상의 아리아**  
불협화음도 괜찮아, 뭐 문제가 되려나?  
모두 내게 반해버려도 난 몰라요  
무지개 멜로디는 저 하늘을`,
  `&nbsp;  
사실 조금은 떨렸다랄까 두근두근대  
지금 난 자꾸 자꾸 듣고 싶어  
내가 너의 최애라고 **말해** **(함성)**  
&nbsp;  
무대 위 춤을 추는 D선 상의 아리아  
불협화음도 괜찮아, 뭐 문제가 되려나?  
모두 내게 반해버려도 난 몰라요  
무지개 멜로디는 저 하늘을 **날아**  
**(We are! We are!)**  
이것도 나야 나야 나 **(We are! We are!)**  
이런 내가 궁금하니  **(We are! We are!)**  
뭘 해도 나야 나야 나 **(We are! We are!)**  
**들어줘 나의 discord**  
`,
];
