export const 메아리 = [
  `**(어이!)**  
  어디선가 들려와  
내 맘의 알람 소리가  
잠들었던 꿈들이 기지개를 켜  
늘 시작은 어색해  
머뭇거리기는 해도  
그건 별문제가 안돼  
혀끝에  
멈춰 선 단어들이  
입술을 톡 두드리면  
한순간 두려운 감정이 앞서  
(자꾸만 겁이 나서)  
숨을 한번 고르고  
외치고 싶어 전부  
때 이른 맘이 아니길  
더 멀리 **더 크게** 모두 말하고 싶어  
긴 숨을 가득 모아서  
분명 네 귓가에 닿을 수 있을 거라고  
푸른 수평선 끝 메아리처럼  
**네게 들린다면**  
내 손을 꼭 잡아줘  
모든 걸 너에게 보여줄 테니`,
  `**(어이!)**    
일기 속에 적어둔  
많이 소중한 꿈들을  
매일 난 외워뒀거든  
솔직한  
모습을 탓한대도  
다시 한번 말할 거야  
이젠 멈추는 게 어려운걸  
(그게 더 어려운 걸)  
같은 맘인 거라면  
여기로 모여 전부  
내게 네 꿈을 들려줘  
더 멀리 **더 크게** 모두 말하고 싶어  
긴 숨을 가득 모아서  
분명 네 귓가에 닿을 수 있을 거라고  
푸른 수평선 끝 메아리처럼  
**네게 들린다면**  
내 손을 꼭 잡아줘  
모든 걸 너에게 보여줄 테니`,
  `**(어이!)**    
고요 사이에 멈춰 둔 흔적에  
가끔 눈물이 차올라도  
한발 가까이 더 다가갈게  
저기 멀리 보이는  
너를 놓지 않을 거야 이제는  
세상에 **들리게** 좀 더 말하고 싶어  
이 맘을 가득 모아서  
두 눈 맞추고 널 크게 안을 거야  
어떤 별을 닮은 꿈들이 네게  
반짝거린다면  
그 얘길 꼭 들려줘  
**함께란 이유가 되어줄 테니**
**(어이!)**
`,
];
