export const 별하 = [
  `**(후레쉬를 흔들어주세요!)**   
조용하게 비춘 별 하나  
인사를 건네는 듯해  
긴 시간 속 매일 그 자리에  
어쩌면 아득히 멀리  
가 있기에 소중한 거라  
외면하고 있었던 나인데  
발걸음과 발걸음 사이  
쌓여만 간 망설임과 무리란 말  
네가 내 곁에 와주던  
순간 전부 사라졌어  
소란하게 내린 별의 빛  
그 틈 사이 사이로  
다시 투명히 비친 눈부신  
나만의 꿈의 조각들  
너와 함께라는 이유로  
운명을 믿어 난  
눈 앞에 펼쳐진 미랠 향해 인사를 해  
빛나는 별처럼  
(Ah, ah, ah)  
저 빛나는 별처럼  
(Ah, ah, ah)  `,
  `&nbsp;  
  난 아이처럼 혼자선 꼭
서투르고 헤매는 걸  
잡은 두 손의 온기로  
좀 더 멀리 데려가 줘  
소란하게 내린 별의 빛  
그 틈 사이 사이로  
다시 투명히 비친 눈부신  
나만의 꿈의 조각들  
너와 함께라는 이유로  
운명을 믿어 난  
눈 앞에 펼쳐진 미랠 향해 인사를 해  
빛나는 별처럼  `,
  `&nbsp;  
  내 맘을 다 아는 듯이  
지어주는 웃음이  
푸른 새벽 같아서  
뭐든 가능할 것 같아  
가장 빛나는 시작도  
찬란해질 내일도  
이제 울지 않아  
너와 나로 이어진 별자리  
우리만의 하모니  
아주 길고 긴 시간 지나도  
반짝일 우릴 테니까  
까만 어둠이 또 온대도  
두렵지 않아 난  
놓치지 않도록 너의 손을 잡아 줄게  
빛나는 별처럼  
(Ah, ah, ah)  
저 빛나는 별처럼  
(Ah, ah, ah)  
저 빛나는 별처럼  
(Ah, ah, ah)  
`,
  ``,
];
