export const 사랑하자 = [
  `  
 **(어이!)**  
 **(ah ah ah ah ah ah)**  
비가 또 내리고 있어  
상처받는 건 지쳤고  
이쯤 해둘까도 싶어서  
도망칠까 했지  
근데 **(어이!)** 말야 **(어이!)** 지겨운 후회 대신  
난 **(어이!)**말야 **(어이!)**더 단단해진 맘을 따라  
달려가겠어 틀린 길이래도  
**상관없어 난**  
힘껏 (어이!) 달려 더 망설이지 말고  
감은 눈을 떠봐  
소리쳐봐 **(어이!)** 더 **(어이!)**  
세상이 다 미워한대도  
오늘 우린  
**사랑하자**  
**사랑하자**  
**사랑하자**  
후회 따위 없이 모두 **사랑하자**`,
  `먹구름이 또 밀려와  
무거워지는 발걸음  
아무리 애써도 이 비를 막을 수 없단 걸  
알고 있지만  
그래도 난 애써온 날 기억해 전부  
누구에게 보이지 **않아도**  
**달려가겠어** 넘어지면 어때  
**다시 일어나**  
힘껏 **(어이!)**달려 **(어이!)** 더 망설이지 말고  
감은 눈을 떠봐  
소리쳐봐 **(어이!)** 더 **(어이!)** 세상이 다 미워한대도  
오늘 우린  
**사랑하자**`,
  `그래 어디 한번 해봐  
그 언제든 난 내가 응원할 거니까  
뭐, 망설였던 건 다 굿바이  
뜨겁게 **사랑하자**  
힘껏 달려 더 시작한 모험에  
끝은 없는 거야  
소리쳐봐 **(어이!)**더 **(어이!)**세상이 다 미워한대도  
오늘 우린  
**사랑하자**  
**사랑하자**  
**사랑하자**  
**사랑하자**  
**사랑하자**  
**사랑하자**  
후회 따위 없이 모두 **사랑하자**`,
];
