export const 수다 = [
  `오늘 날씨도 딱 취향이구  
OOTD도 완벽한데  
이게 무슨 일이람 전혀 기분이 안 나  
혹시 너의 답장이 오지 않아설까?  
딸기케익 한입에 좀 풀리다가도  
떠오른 네 생각에 또 답답해지잖아  
혹시 내 머릿속이 어떻게 돼버린걸까나?  
이건 다 너 때문이라구**요, 네**?  
이랬다 저랬다, 변덕스러운 것도  
이게 다 전부 다 널 향한 나의 치기  
그니까, 그니까 네가 내게 와준다면  
**수수께끼 같던 내 진심을 말해줄게**  
좋아해, 좋아한다구**요, 네?**  
내게 와, 내게 와줄 거**죠, 네?**`,
  `두근대는 맘은 비밀이구  
한 번 물어볼까? **오늘 뭐 해?**  
머리부터 손끝까지 준비했지만  
시치미 뚝 떼고 편하게 나온 척할래!  
어떤 말을 해야 너를 사로잡을까?  
고민만 해봐도 두 볼이 빨개지잖아  
발만 동동 구르는 나 초조해 보일까나  
이건 다 너 때문이라구**요, 네?**  
이랬다 저랬다, 변덕스러운 것도  
이게 다 전부 다 널 향한 나의 치기  
그니까, 그니까 네가 내게 와준다면  
**수수께끼 같던 내 진심을 말해줄게**`,
  `그렇게 가까이 다가오면 나는  
당황한 표정 숨길 수 없다구요  
잠시, 잠시, 거기서 대기  
숨 한번 **참았다가 chu**  
이랬다 저랬다, 변덕스러운 것도  
이게 다 전부 다 널 향한 나의 치기  
그니까, 그니까 네가 나만 봐준다면  
**수수께끼 같던 내 진심을 말해줄게**  
나만 봐, 나만 봐줄 거**죠, 네?**  
내일은 더 좋아해 줄 거**죠, 네?**`,
];
