export const bye = [
  `  **(손 흔들기)**
어떻게 지냈어  
한마디 건네보기엔  
멀리 와버린 걸까  
늘 같은 얘기로  
상처를 주고 나서야  
늦은 후회를 하나 봐  
엎지른 마음은  
아무리 돌이키려 해도  
소용없는 일인 걸  
어떻게 해도 다시  
그때로 되돌릴 수는 없잖아  
뚝뚝 떨어진 눈물  
떨린 네 목소리는  
내게 향해있던 걸  
이제야 알아  
너무 오래 이곳에  
멈춰둬서 미안해  
많이 늦은 인사를 끝으로  
Bye-bye 이젠 정말 보내주려 해  
뻔한 인삿말이 쉽진 않겠지만  
괜찮아, 슬픔이 지나간  
그 자리에 또 새로운  
추억이 너를 안아줄 테니까`,
  `가장 미운 말들을  
쏟아내던 거울 속 내게  
작은 안부를 건네  
버텨줘서 고마워  
이제는 좀 더 용기 내보려 해  
서로의 반대편에  
각자의 세상 속에  
한 발 걸음을 옮겨  
있잖아, 우리  
언젠가 또 만나면  
환하게 웃어주자  
마지막 이 인사를 끝으로  
Bye-bye 이젠 정말 보내주려 해  
뻔한 인삿말이 쉽진 않겠지만  
괜찮아, 슬픔이 지나간  
그 자리에 또 새로운  
추억이 널 안아줄 거야  
Bye-bye 이젠 안녕, 일렁이던 밤  
Bye-bye 기억들을 끌어안고서 이제  
상처투성이 손으로  
마지막 인사를 전해  
고마웠어, 모든 순간  
Bye-bye 이젠 정말 보내주려 해  
안녕 한 마디가 어려운 나였지만  
머금던 맘을 열어보니  
지난 나의 발자국에  
서투른 꽃이 피어나  
**라라 라라라라**  
**라라라라 라라라라**  
**라라 라라 라라라**  
`,
];
