export const 지구정복 = [
  `두 손에 쥔 이 기타와  
심장박동을 맞추자  
이 템포를 기억해 둬  
우리가 가는 길을 잃지 않게  
  
시작선 위로 피어난 긴장도  
우리를 막진 못해  
(두근대는 심장 소리, 이건 우리의 **신호탄!**)   
시간이 충분할지 모르겠어  
이대론 무리지  
(좀 더 속도를 내볼까, 더 이상은 미룰 수 없어)  
  
여섯 줄의 울림  
그 위로 모든 진심을 담아본다  
준비는 끝  
**이제부터 시작이야**  
  
전속력으로 돌진**해** 지구 저 끝까지  
이 한숨에 전부를 걸어볼 테니까  
함성소리 **팡!** 터질 때까지  
이 노래를 부를 거야  
우리 목표는  
  
지구! **(지구!)** 정복! **(정복!)**  
더 크게 볼륨을 올려 줘  
지구! **(지구!)** 정복! **(정복!)**  
온 세상이 떠들썩하게`,

  `평범히 다가가는 법은 몰라  
그대론 안 하지  
(좀 더 과감해 볼까, 겁이라는 건 다 버렸어)  
  
적막한 이 세상에  
스피커를 켠 다음  
고요하게 잠든 이 도시를  
다시 뜨겁게 연주해보는 거야  
잘 들어봐  
**이제부터 시작이야**  
  
전속력으로 돌진**해** 지구 저 끝까지  
이 한숨에 전부를 걸어볼 테니까  
함성소리 **팡!** 터질 때까지  
이 노래를 부를 거야  
우리 목표는`,

  `시작했으니 끝을 보자고  
포기 따윈 계획엔 없어  
다들 들어줘 좀 더  
멋지게 **울려라 기타!**  
  
가보 가보 자  
**(저 멀리 더)**  
라랄 라랄 라  
**(노래해 더)**  
말했다시피 뭐! 우리 목표는 말야!  
**(지구 정복이다)**  
  
전속력으로 돌진**해** 지구 저 끝까지  
이 한숨에 전부를 걸어볼 테니까  
함성소리 **팡!** 터질 때까지  
이 노래를 부를 거야  
우리 목표는  
  
지구! **(지구!)** 정복! **(정복!)**  
더 크게 볼륨을 올려 줘  
지구! **(지구!)** 정복! **(정복!)**  
온 세상이 떠들썩하게  
지구! **(지구!)** 정복! **(정복!)**  
더 크게 볼륨을 올려 줘  
지구! **(지구!)** 정복! **(정복!)**  
온 세상이 떠들썩하게  
`,
];
