export const 짭돌 = [
  `**만나서 반가워 우릴 소개하자면**  
**Q-W-E-R인데**  
혹시 모르는 분들 위해서 한번 더  
**Roll, roll, rock and roll**  
우리는 불협 사이렌  
울지 않고 아껴둔 힘 모아서  
소릴 높여봐, **이 순간**  
어쩌나 시끄러운 우리들  
가짜라고 놀려대도  
기필코 너에게 진심을 전할게  
지켜봐 줘 우린 너의 **i-idol**  
**Ha-ha, ha-ha, ha**  
하나, 둘 세상을 뒤집자  
**Ha, ha-ha, ha-ha, ha**  
무대 위 피어난 **너만의 idol**  
Ha!  
**Ok!**  
Hey! **One! Two! Q! W! E! R!**`,
  `알고리즘에서 태어나  
색안경 위로 꽃을 피우자  
온 세상을 연주해 버릴 거야  
**잘 들어보세요**  
우리는 불협 사이렌  
울지 않고 아껴둔 힘 모아서  
모두 뒤집어 버리자  
어쩌나 시끄러운 우리들  
가짜라고 놀려대도  
기필코 너에게 진심을 전할게  
지켜봐 줘 우린 너의 **i-idol**  
**Ha-ha, ha-ha, ha**  
하나, 둘 세상을 뒤집자  
**Ha, ha-ha, ha-ha, ha**  
무대 위 피어난 **너만의 idol**  
Ha!  
**어이!x4**  
동화 속 마법의 숲 괴물도  
우릴 막아설 순 없어  
기타를 메고 하늘에 닿을 때까지  
달려볼게, 노래할게 **la-la-la**  
**Ha-ha, ha-ha, ha**  
짜릿하게 반전을 선사  
**Ha, ha-ha, ha-ha, ha**  
지켜봐 줘 우린 **너만의 idol**  
  
**Ha! Ha! Ha! Ha! Ha! Ha!**  
너만의 idol  
`,
];
